Examinator/src/InformationRegisters/ФИОПользователейСУО/ФИОПользователейСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ФИОПользователейСУО</name>
  <resources>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ДокументыТребующиеПерепроведенияСУО/ДокументыТребующиеПерепроведенияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДокументыТребующиеПерепроведенияСУО</name>
  <attributes>
    <name>Владелец</name>
    <type>
      <types>AnyRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Важность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДобавления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимЗаписиДокумента</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбновлятьПодчиненныеДокументы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПовтора</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/НастройкиПользователейСУО/НастройкиПользователейСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиПользователейСУО</name>
  <attributes>
    <name>СкрытьКонтактнуюИнформацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрытьДополнительныеСведения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьРассылкуНаАдресЭлектроннойПочты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьУведомленияОНовыхЛичныхСообщениях</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьУведомленияОНовыхСообщенияхФорума</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/СотрудникиСУО/СотрудникиСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СотрудникиСУО</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизацииСУО</types>
    </type>
  </resources>
  <resources>
    <name>ПодразделениеПредприятия</name>
    <type>
      <types>CatalogRef.ПодразделенияПредприятияСУО</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ДолжностиСУО</types>
    </type>
  </resources>
  <attributes>
    <name>Уволен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТабельныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Documents/ПроведениеПрограммыОбученияСУО/ПроведениеПрограммыОбученияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПроведениеПрограммыОбученияСУО</name>
  <basedOn>Catalog.КаталогПрограммОбученияСУО</basedOn>
  <registerRecords>InformationRegister.ОткрытыеПрограммыОбученияСУО</registerRecords>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПроведенияОбъектовСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>БезСценария</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрограммаОбучения</name>
    <type>
      <types>CatalogRef.КаталогПрограммОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ОткрытаяПрограмма</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОткрытоДляВсех</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОткрытияЗаписи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытияЗаписи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяЗаявка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальноеКоличествоУчастников</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийДляУчастника</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийДляМенеджера</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийОткрытойПрограммыДляУчастника</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПроведения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПроведения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОткрытоДляРуководителей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапросНаОбучение</name>
    <type>
      <types>DocumentRef.ЗапросНаОбучениеСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеДляУчастника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторОбъектаКопирования</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УчебныеГруппы</name>
    <attributes>
      <name>УчебнаяГруппа</name>
      <type>
        <types>CatalogRef.УчебныеГруппыСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Должности</name>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.ДолжностиСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Организации</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПодразделенияПредприятия</name>
    <attributes>
      <name>ПодразделениеПредприятия</name>
      <type>
        <types>CatalogRef.ПодразделенияПредприятияСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Организаторы</name>
    <comment>Заполняется в подписке УстановитьОтветственногоДокументаСУО</comment>
    <attributes>
      <name>Организатор</name>
      <type>
        <types>CatalogRef.ОрганизаторыСУО</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Examinator/src/Documents/СообщениеСУО/СообщениеСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СообщениеСУО</name>
  <basedOn>Catalog.ШаблоныСообщенийСУО</basedOn>
  <registerRecords>InformationRegister.ТемыПользователейСУО</registerRecords>
  <registerRecords>InformationRegister.СообщенияТемСУО</registerRecords>
  <registerRecords>InformationRegister.ТемыМодераторовСУО</registerRecords>
  <registerRecords>InformationRegister.ЛичныеСообщенияПользователейСУО</registerRecords>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>CatalogRef.ТемыСообщенийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматированныйДокумент</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяТекстовыйДокумент</name>
    <comment>Введено для сохранения оригинала сообщения из веб-кабинета</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстовыйДокумент</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПервоеСообщениеВТеме</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>DocumentRef.НовостьСУО</types>
      <types>CatalogRef.ШаблоныСообщенийСУО</types>
      <types>DocumentRef.РассылкаСообщенийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Рассылка</name>
    <type>
      <types>DocumentRef.РассылкаСообщенийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоЭлектроннаяПочта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительскоеСообщение</name>
    <type>
      <types>DocumentRef.СообщениеСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>УдаленоМодератором</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУдаленияМодератором</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалившийМодератор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗначенияПеременных</name>
    <attributes>
      <name>Переменная</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ПеременныеШаблоновСообщенийСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ПеременныеШаблоновСообщенийСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеАдреса</name>
    <attributes>
      <name>АдресЭлектроннойПочты</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Examinator/src/Catalogs/ТемыСообщенийСУО/ТемыСообщенийСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТемыСообщенийСУО</name>
  <attributes>
    <name>Кому</name>
    <type>
      <types>EnumRef.АдресатыСообщенийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Контекст</name>
    <type>
      <types>CatalogRef.РазделыФорумаСУО</types>
      <types>CatalogRef.ОрганизаторыСУО</types>
      <types>CatalogRef.УчебныеГруппыСУО</types>
      <types>DocumentRef.ПрохождениеПрограммыОбученияСУО</types>
      <types>DocumentRef.ПроведениеПреподавателемОбученияСУО</types>
      <types>DocumentRef.ПрохождениеОбученияСУО</types>
      <types>DocumentRef.ПроведениеПрограммыОбученияСУО</types>
      <types>CatalogRef.УчебныеГруппыОО</types>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Закрыта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Рассылка</name>
    <type>
      <types>DocumentRef.РассылкаСообщенийСУО</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеПолучатели</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДобавления</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсключенныеПолучатели</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДобавления</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/CommonModules/УправлениеОбучениемСУОПодписки/Module.bsl
// Общее

Процедура УстановкаОтветственногоСУОПередЗаписью(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда 
    	Возврат; 
	КонецЕсли;	
	
	Если НЕ Источник.ЭтоГруппа И НЕ ЗначениеЗаполнено(Источник.Ответственный) Тогда
		Источник.Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	УправлениеОбучениемСУО.ЗаполнитьОрганизаторовОбъекта(Источник);
	
КонецПроцедуры

Процедура УстановитьОтветственногоДокументаСУОПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда 
    	Возврат; 
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(Источник.Ответственный) Тогда
		Источник.Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	УправлениеОбучениемСУО.ЗаполнитьОрганизаторовОбъекта(Источник);
		
КонецПроцедуры

Процедура УстановкаДатыИзмененияСУОПередЗаписью(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда 
    	Возврат; 
	КонецЕсли;		
	
	Если НЕ Источник.ЭтоГруппа Тогда
		Источник.ДатаИзменения = ТекущаяДата();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриИзмененииИспользованияЭлектронныхКурсовБЭОПриЗаписи(Источник, Отказ) Экспорт
	РегистрыСведений.НастройкиУчебныхМатериаловСУО.УстановитьНастройки();
КонецПроцедуры

// Пользователи

Процедура ДобавитьПользователяВСУОПриЗаписи(Источник, Отказ) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	РегистрыСведений.ФИОПользователейСУО.ДобавитьСведения(Источник.Ссылка, Источник.Наименование);
	
	Если Источник.ДополнительныеСвойства.Свойство("ЭтоНовый")
		И Источник.ДополнительныеСвойства.ЭтоНовый Тогда
		
		ЗапрещеноНазначатьГруппуДоступа = Источник.ДополнительныеСвойства.Свойство("ЗапретитьУстановкуГруппыДоступаДляНовыхПользователей");
		
		ЗапрещеноНазначатьГруппуДоступа = ?(ЗапрещеноНазначатьГруппуДоступа = Неопределено, Ложь, ЗапрещеноНазначатьГруппуДоступа);
		
		Если НЕ ЗапрещеноНазначатьГруппуДоступа Тогда
		
			// Добавляем пользователя в группу доступа по умолчанию
					
			ГруппаДоступаПоУмолчанию = Константы.ГруппаДоступаДляНовыхПользователейСУО.Получить();

			Если ЗначениеЗаполнено(ГруппаДоступаПоУмолчанию) Тогда
				
				ГруппаДоступаОбъект = ГруппаДоступаПоУмолчанию.ПолучитьОбъект();
				
				Если ГруппаДоступаОбъект.Пользователи.Найти(Источник.Ссылка, "Пользователь") = Неопределено Тогда
					ГруппаДоступаОбъект.Пользователи.Добавить().Пользователь = Источник.Ссылка;
				КонецЕсли;
				
				ГруппаДоступаОбъект.Записать();
				
			КонецЕсли;
			
		КонецЕсли;
			
		// Зачисляем на обучение
		
		Запрос = Новый Запрос;

		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПроведениеОбученияСУО.Ссылка
			|ИЗ
			|	Документ.ПроведениеОбученияСУО КАК ПроведениеОбученияСУО
			|ГДЕ
			|	ПроведениеОбученияСУО.Проведен = ИСТИНА
			|	И ПроведениеОбученияСУО.ОткрытоДляВсех = ИСТИНА
			|	И ПроведениеОбученияСУО.ОткрытоДляРуководителей = ЛОЖЬ
			|;";
			
		Запрос.Текст = Запрос.Текст + "
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ПроведениеПрограммыОбученияСУО.Ссылка
			|ИЗ
			|	Документ.ПроведениеПрограммыОбученияСУО КАК ПроведениеПрограммыОбученияСУО
			|ГДЕ
			|	ПроведениеПрограммыОбученияСУО.Проведен = ИСТИНА
			|	И ПроведениеПрограммыОбученияСУО.ОткрытоДляВсех = ИСТИНА
			|	И ПроведениеПрограммыОбученияСУО.ОткрытоДляРуководителей = ЛОЖЬ";
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		
		Для каждого Результат Из МассивРезультатов Цикл
		
			ВыборкаДетальныеЗаписи = Результат.Выбрать();
			
			РегистрыСведений.ДокументыТребующиеПерепроведенияСУО.ДобавитьДокументы(ВыборкаДетальныеЗаписи,,,3);
		
		КонецЦикла;
		
		// Добавляем общие темы форума
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТемыСообщенийСУО.Ссылка
			|ИЗ
			|	Справочник.ТемыСообщенийСУО КАК ТемыСообщенийСУО
			|ГДЕ
			|	ТемыСообщенийСУО.Контекст.ДляВсех = ИСТИНА";
		
		МассивОбщихТем = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СообщениеСУО.Ссылка
			|ИЗ
			|	Документ.СообщениеСУО КАК СообщениеСУО
			|ГДЕ
			|	СообщениеСУО.Проведен = ИСТИНА
			|	И СообщениеСУО.Тема В(&МассивОбщихТем)
			|	И СообщениеСУО.ПервоеСообщениеВТеме = ИСТИНА";
		
		Запрос.УстановитьПараметр("МассивОбщихТем", МассивОбщихТем);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		РегистрыСведений.ДокументыТребующиеПерепроведенияСУО.ДобавитьДокументы(ВыборкаДетальныеЗаписи,,,3);
		
		// Устанавливаем настройки по умолчанию
		
		НастройкиПоУмолчанию = РегистрыСведений.НастройкиПользователейСУО.СоздатьНаборЗаписей();
		
		НастройкиПоУмолчанию.Отбор.Пользователь.Установить(Справочники.Пользователи.ПустаяСсылка());
		
		НастройкиПоУмолчанию.Прочитать();
		
		Если НастройкиПоУмолчанию.Количество() = 1 Тогда
			
			РеквизитыНастроек = Метаданные.РегистрыСведений.НастройкиПользователейСУО.Реквизиты;
			
			МенеджерЗаписиНастроек = РегистрыСведений.НастройкиПользователейСУО.СоздатьМенеджерЗаписи();
			МенеджерЗаписиНастроек.Пользователь = Источник.Ссылка;
			
			Для каждого РеквизитНастройки Из РеквизитыНастроек Цикл
			
				МенеджерЗаписиНастроек[РеквизитНастройки.Имя] = НастройкиПоУмолчанию[0][РеквизитНастройки.Имя];
			
			КонецЦикла;
			
			МенеджерЗаписиНастроек.Записать(Истина);
			
		КонецЕсли;
		
		// Создаем рассылку
		
		УправлениеОбучениемСУО.СоздатьАвтоматическуюРассылку(Источник);
		
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ПользователиОбработкаПолученияФормы(Источник, ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка) Экспорт

	Если ВидФормы = "ФормаВыбора" Тогда
		
		Если (Параметры.Свойство("РежимВыбора") И Параметры.РежимВыбора)
			 И НЕ Параметры.Свойство("ВыборГруппПользователей")
			 И НЕ Параметры.Свойство("РасширенныйПодбор") Тогда
			
			// Данная форма подбора не поддерживает подбор групп (ВыборГруппПользователей),
			// поэтому в этом случае используем стандартную форму.
			
			СтандартнаяОбработка = Ложь;
			
			ВыбраннаяФорма = "ОбщаяФорма.ПодборПользователейСУО";	
			
		КонецЕсли;
			
	КонецЕсли;
		
КонецПроцедуры

// Запись информации о руководителях подразделений, организаций и сотрудников.

Процедура ЗаписатьДанныеОРуководителяхОбъектаСУОПриЗаписи(Источник, Отказ) Экспорт
	
	// Делаем проверки
	
	Если Источник.ОбменДанными.Загрузка Тогда
		
		// Примечание: при загрузке данных порядок записи элементов может быть произвольным,
		// Поэтому нет смысла записывать данные о руководителях, так как они могут оказаться неверными.
		
		Возврат;
		
	КонецЕсли;
	
	// Записываем данные о руководителях самого объекта
	
	УправлениеОбучениемСУО.ЗаписатьДанныеОРуководителяхЭлементаСтруктурыПредприятия(Источник, Отказ);

	// Если это учебная группа, то записываем руководителей участников этой группы
	
	Если ТипЗнч(Источник.Ссылка) = Тип("СправочникСсылка.УчебныеГруппыСУО") Тогда
		
		Для каждого УчастникГруппы Из Источник.Состав Цикл
			УправлениеОбучениемСУО.ЗаписатьДанныеОРуководителяхСотрудника(УчастникГруппы.Пользователь);
		КонецЦикла;
		
	КонецЕсли;
	
	// Если это организация, то записываем данные о руководителях подразделений организации (подчиненная сущьность).
	
	Если ТипЗнч(Источник.Ссылка) = Тип("СправочникСсылка.Организации") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПодразделенияОрганизацииСУО.Ссылка
			|ИЗ
			|	Справочник.ПодразделенияОрганизацииСУО КАК ПодразделенияОрганизацииСУО
			|ГДЕ
			|	ПодразделенияОрганизацииСУО.Владелец = &Организация";

		Запрос.УстановитьПараметр("Организация", Источник.Ссылка);

		Результат = Запрос.Выполнить();

		ВыборкаДетальныеЗаписи = Результат.Выбрать();

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			УправлениеОбучениемСУО.ЗаписатьДанныеОРуководителяхЭлементаСтруктурыПредприятия(ВыборкаДетальныеЗаписи.Ссылка, Отказ);
		КонецЦикла;

	КонецЕсли;
	
	// Записываем данные о руководителях сотрудников
	
	Если ТипЗнч(Источник.Ссылка) = Тип("СправочникСсылка.Организации") Тогда
		ИмяИсточника = "Организация";
	КонецЕсли;
	
	Если ТипЗнч(Источник.Ссылка) = Тип("СправочникСсылка.ПодразделенияОрганизацииСУО") Тогда
    	ИмяИсточника = "ПодразделениеОрганизации";
	КонецЕсли;
	
	Если ТипЗнч(Источник.Ссылка) = Тип("СправочникСсылка.ПодразделенияПредприятияСУО") Тогда
		ИмяИсточника = "ПодразделениеПредприятия";
	КонецЕсли;
	
	Если ИмяИсточника <> Неопределено Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СотрудникиСУОСрезПоследних.Пользователь,
			|	СотрудникиСУОСрезПоследних.Организация,
			|	СотрудникиСУОСрезПоследних.ПодразделениеОрганизации,
			|	СотрудникиСУОСрезПоследних.ПодразделениеПредприятия
			|ИЗ
			|	РегистрСведений.СотрудникиСУО.СрезПоследних(,) КАК СотрудникиСУОСрезПоследних
			|
			|ГДЕ СотрудникиСУОСрезПоследних.Уволен = ЛОЖЬ
			| И СотрудникиСУОСрезПоследних."+ИмяИсточника+" = &Источник";

		Запрос.УстановитьПараметр("Источник", Источник.Ссылка);

		Результат = Запрос.Выполнить();

		ВыборкаСотрудников = Результат.Выбрать();
		МассивСотрудников  = Результат.Выгрузить().ВыгрузитьКолонку("Пользователь");

		Для каждого Сотрудник Из МассивСотрудников Цикл
			УправлениеОбучениемСУО.ЗаписатьДанныеОРуководителяхСотрудника(Сотрудник, ВыборкаСотрудников);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Присоединенные файлы

Процедура ПрисоединенныйФайлПриЗаписиСУОПриЗаписи(Источник, Отказ) Экспорт
	
	РегистрыСведений.ДокументыТребующиеПерепроведенияСУО.ДобавитьДокумент(Источник.ВладелецФайла);
	
КонецПроцедуры
